In [1]:
import sys
import os
sys.path.append(os.path.abspath("../src"))

import datetime as dt
import numpy as np
import pandas as pd
pd.set_option('display.max_rows', 100)

from etl import quarter_to_dt

## Methodology:

I will clean and transform each dataframe separated by question, so for the first question I will verify and make the transformations needed in the related dataframes, and the same for the remaining questions.

**Question 1.** Which economic sectors have experienced the highest growth since 2010, and how did the COVID-19 pandemic shift their trajectories?  
**Related dataframes**: QLF03, QLF05, QLF07, QLF32, QES01, QES03

In [2]:
# quick visualization of each df
q1_related = ['QLF03', 
              'QLF05', 
              'QLF07']
# deleted from the related QES01, QES03, QLF32 because of the lack of info compared to the others
# will delete QLF05, QLF07 because of the inconsistency of what makes an "adult"
# checked if the total (all region, sex and sector) for QLF03 and QLF05 + QLF07, and returned different numbers (27.1 difference)
# decided to go with QLF03, cause it provide the exact data that I need

for df in q1_related:
    df_v = pd.read_csv(f'../data/raw/{df}.csv')

    print(f'{df} Dataframe')
    display(df_v.head(3))
    print('-------------------')

QLF03 Dataframe

,Statistic,Quarter,Sex,NACE Rev 2 Economic Sector,value
0,Persons aged 15-89 years in Employment,1998Q1,Both sexes,All NACE economic sectors,1550.3
1,Persons aged 15-89 years in Employment,1998Q1,Both sexes,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15-89 years in Employment,1998Q1,Both sexes,Construction (F),103.7

-------------------
QLF05 Dataframe

,Statistic,Sex,NACE Rev 2 Economic Sector,Region,Quarter,value
0,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q1,1550.4
1,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q2,1572.1
2,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q3,1636.3

-------------------
QLF07 Dataframe

,STATISTIC,Quarter,Sex,NACE Rev 2 Economic Sector,Region,value
0,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,State,1862.6
1,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,Border,145.1
2,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,West,175.8

-------------------

In [3]:
# Transforming the Quarter column from string to datetime
df_qlf03 = pd.read_csv(f'../data/raw/QLF03.csv')
quarter_to_dt(df_qlf03)

**Question 2. How has foreign workforce participation evolved in Ireland since the early 2000s?**

In [4]:
# quick visualization of each df
q2_related = ['QLF34', 'QLF35', 'QLF47', 'QLF48']

# can use all of those dataframes, being QLF34/QLF47 for explaining how much more people from outside work
# QLF34/QLF47 to show which sectors most employ foreigners

for df in q2_related:
    df_v = pd.read_csv(f'../data/raw/{df}.csv')

    print(f'{df} Dataframe')
    display(df_v.head(3))
    print('-------------------')

QLF34 Dataframe

,STATISTIC,Quarter,Nationality,NACE Rev 2 Economic Sector,value
0,Persons aged 15 years and over in Employment,1998Q1,All nationalities,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment,1998Q1,All nationalities,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment,1998Q1,All nationalities,Construction (F),103.7

-------------------
QLF35 Dataframe

,STATISTIC,Quarter,Nationality,ILO Economic Status,value
0,Persons aged 15 years and over,1998Q1,All nationalities,All ILO economic status,2857.2
1,Persons aged 15 years and over,1998Q1,All nationalities,In labour force,1699.0
2,Persons aged 15 years and over,1998Q1,All nationalities,In employment,1550.3

-------------------
QLF47 Dataframe

,Statistic,Quarter,NACE Rev 2 Economic Sector,Citizenship,value
0,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,All Countries,2259.9
1,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,EU14 excl Irl (countries in the EU pre 2004 ex...,60.7
2,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,EU15 to EU27 (accession countries joined post ...,137.1

-------------------
QLF48 Dataframe

,Statistic,Quarter,ILO Economic Status,Citizenship,value
0,Persons aged 15 years and over,2021Q1,All ILO economic status,All Countries,4056.3
1,Persons aged 15 years and over,2021Q1,All ILO economic status,EU14 excl Irl (countries in the EU pre 2004 ex...,80.9
2,Persons aged 15 years and over,2021Q1,All ILO economic status,EU15 to EU27 (accession countries joined post ...,207.1

-------------------

In [5]:
df_qlf34 = pd.read_csv(f'../data/raw/QLF34.csv')
quarter_to_dt(df_qlf34)

df_qlf35 = pd.read_csv(f'../data/raw/QLF35.csv')
quarter_to_dt(df_qlf35)

df_qlf47 = pd.read_csv(f'../data/raw/QLF47.csv')
quarter_to_dt(df_qlf47)

df_qlf48 = pd.read_csv(f'../data/raw/QLF48.csv')
quarter_to_dt(df_qlf48)

In [6]:
# dictionary for each nationality in QLF34 and QLF35, all of them being mutually exclusive
natio_dict = {'EU14 excl Irl (countries in the EU pre 2004 excluding UK & Ireland)': 'EU14',
              'EU15 to EU27 (accession countries joined post 2004)': 'EU15-27',
              'UK': 'UK',
              'Irish' : 'Irish',
              'Other nationalities (7)': 'Non-EU'}

# dictionary for each citizenship in QLF47 and QLF48
citi_dict = {'EU14 excl Irl (countries in the EU pre 2004 excluding UK & Ireland)': 'EU14',
             'EU15 to EU27 (accession countries joined post 2004)': 'EU15-27',
             'United Kingdom': 'UK',
             'Ireland' : 'Irish',
             'All countries excluding Ireland,United Kingdom and EU272020': 'Non-EU'}

In [7]:
df_qlf47.rename(columns={'Citizenship': 'Nationality'},
                         inplace=True)
df_qlf48.rename(columns={'Citizenship': 'Nationality'}, 
                         inplace=True)

In [8]:
q2_dataframes = [df_qlf34, df_qlf35, df_qlf47, df_qlf48]

In [9]:
# renaming the nationality and citizenship columns in data to merge them later
for df in q2_dataframes:
    if df is df_qlf34 or df is df_qlf35:
        df['Nationality'] = df['Nationality'].map(natio_dict)
    else:
        df['Nationality'] = df['Nationality'].map(citi_dict)

    df.drop(df[df['Nationality'].isnull()].index, inplace=True)
    df.reset_index(drop=True, inplace=True)

    df.columns = df.columns.map(lambda x: x.lower().replace(' ', '_'))

#df_qlf34['Nationality'] = df_qlf34['Nationality'].map(natio_dict)
#df_qlf35['Nationality'] = df_qlf35['Nationality'].map(natio_dict)
#df_qlf47['Nationality'] = df_qlf47['Nationality'].map(citi_dict)
#df_qlf48['Nationality'] = df_qlf48['Nationality'].map(citi_dict)

#df.drop(df[df['Nationality'].isnull()].index, inplace=True)
#df.reset_index(drop=True,
#                     inplace=True)

In [10]:
# ordering the dataframes based on the ones they will concatenate
df_qlf47 = df_qlf47[df_qlf34.columns]
df_qlf48 = df_qlf48[df_qlf35.columns]

In [11]:
q2_dataframes = [df_qlf34, df_qlf35, df_qlf47, df_qlf48]

for df in q2_dataframes:
    df_v = df

    display(df_v.head(3))
    print('-------------------')

,statistic,quarter,nationality,nace_rev_2_economic_sector,value,period,date
0,Persons aged 15 years and over in Employment,1998Q1,EU14,All NACE economic sectors,7.0,1998Q1,1998-01-01
1,Persons aged 15 years and over in Employment,1998Q1,EU14,"Agriculture, forestry and fishing (A)",NaN,1998Q1,1998-01-01
2,Persons aged 15 years and over in Employment,1998Q1,EU14,Construction (F),NaN,1998Q1,1998-01-01

-------------------

,statistic,quarter,nationality,ilo_economic_status,value,period,date
0,Persons aged 15 years and over,1998Q1,EU14,All ILO economic status,10.5,1998Q1,1998-01-01
1,Persons aged 15 years and over,1998Q1,EU14,In labour force,7.5,1998Q1,1998-01-01
2,Persons aged 15 years and over,1998Q1,EU14,In employment,7.0,1998Q1,1998-01-01

-------------------

,statistic,quarter,nationality,nace_rev_2_economic_sector,value,period,date
0,Persons aged 15 years and over in Employment,2021Q1,EU14,All NACE economic sectors,60.7,2021Q1,2021-01-01
1,Persons aged 15 years and over in Employment,2021Q1,EU15-27,All NACE economic sectors,137.1,2021Q1,2021-01-01
2,Persons aged 15 years and over in Employment,2021Q1,UK,All NACE economic sectors,46.4,2021Q1,2021-01-01

-------------------

,statistic,quarter,nationality,ilo_economic_status,value,period,date
0,Persons aged 15 years and over,2021Q1,EU14,All ILO economic status,80.9,2021Q1,2021-01-01
1,Persons aged 15 years and over,2021Q1,EU15-27,All ILO economic status,207.1,2021Q1,2021-01-01
2,Persons aged 15 years and over,2021Q1,UK,All ILO economic status,91.3,2021Q1,2021-01-01

-------------------

In [13]:
# concatenating the dataframes that will be used for answering the question 2
df_q2 = pd.concat([df_qlf35, df_qlf48], ignore_index=True)
df_q2extra = pd.concat([df_qlf34, df_qlf47], ignore_index=True)

**Question 3. How has the balance between Full-time and Part-time employment shifted over time?**

In [23]:
# I will use QES06 for answering this question

df_q3 = pd.read_csv('../data/raw/QES06.csv')

df_q3.columns = df_q3.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q3

,statistic,quarterly,full_and_part_time_status,nace_rev_2_economic_sector,value
0,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Construction (F),103.7
3,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Wholesale and retail trade; repair of motor ve...,219.5
4,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Transportation and storage (H),65.6
...,...,...,...,...,...
5881,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,"Financial, insurance and real estate activitie...",13.6
5882,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Other NACE activities (R to U),50.1
5883,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Industry and Construction (B to F),38.8
5884,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Services (G to U),527.2
5885,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Not stated,NaN